app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def index
    @posts = Post.all.order(created_at: 'desc')

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "b"], ["created_at", "2019-02-23 20:57:25.826001"], ["updated_at", "2019-02-23 20:57:25.826001"]]
---
  def create
    # render plain: params[:post].inspect
    # @post = Post.new(params[:post])
    @post = Post.new(post_params)
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "asdfasd\r\nasdfasdf"], ["updated_at", "2019-02-23 21:24:05.776880"], ["id", 7]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)